; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v2 ?v12)
             (pred_2 ?v3 ?v6)
             (pred_11 ?v2 ?v6)
             (pred_6 ?v5 ?v2 )
	     (pred_7 ?v2)
             (pred_12 ?v9)
             (pred_5 ?v3)
             (pred_3 ?v6)
             (pred_10 ?v2)
             (pred_9 ?v3)
             (pred_4 ?v2)
             (pred_8 ))



(:action op_4
:parameters (?v13 ?v8 ?v7 ?v4)
:precondition (and (pred_12 ?v13) (pred_12 ?v8) (pred_5 ?v7) (pred_3 ?v4)
          (pred_1 ?v13 ?v8) (pred_2 ?v7 ?v4)
                   (pred_11 ?v8 ?v4) (pred_7 ?v13) 
                   (pred_10 ?v8) (pred_9 ?v7))
:effect (and  (pred_4 ?v8) (not (pred_10 ?v8))))


(:action op_2
:parameters (?v13 ?v10)
:precondition (and (pred_12 ?v13) (pred_12 ?v10)
               (pred_7 ?v13) (pred_1 ?v13 ?v10) (pred_4 ?v10))
:effect (and (pred_7 ?v10) (not (pred_7 ?v13))))

(:action op_5
:parameters (?v13 ?v7)
:precondition (and (pred_12 ?v13) (pred_5 ?v7) 
                  (pred_7 ?v13) (pred_6 ?v7 ?v13) (pred_8 ))
:effect (and (pred_9 ?v7)
   (not (pred_6 ?v7 ?v13)) (not (pred_8 ))))


(:action op_1
:parameters (?v13 ?v11 ?v1)
:precondition (and (pred_12 ?v13) (pred_5 ?v11) (pred_5 ?v1)
                  (pred_7 ?v13) (pred_9 ?v1) (pred_6 ?v11 ?v13))
:effect (and (pred_9 ?v11) (pred_6 ?v1 ?v13)
        (not (pred_9 ?v1)) (not (pred_6 ?v11 ?v13))))

(:action op_3
:parameters (?v13 ?v7)
:precondition (and (pred_12 ?v13) (pred_5 ?v7) 
                  (pred_7 ?v13) (pred_9 ?v7))
:effect (and (pred_8 ) (pred_6 ?v7 ?v13) (not (pred_9 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_17 obj_02 obj_29 obj_22 obj_04 obj_25 obj_11 obj_07 obj_28 obj_06 obj_26 obj_27 obj_15 obj_01 obj_03 obj_24 obj_31 obj_08 obj_20 obj_19 obj_05 obj_14 obj_23 obj_10
    obj_13 obj_09 obj_21
    obj_16 obj_30 obj_18
    )

    (:init
       (pred_8)

       (pred_12 obj_12)
       (pred_12 obj_17)
       (pred_12 obj_02)
       (pred_12 obj_29)
       (pred_12 obj_22)
       (pred_12 obj_04)
       (pred_12 obj_25)
       (pred_12 obj_11)
       (pred_12 obj_07)
       (pred_12 obj_28)
       (pred_12 obj_06)
       (pred_12 obj_26)
       (pred_12 obj_27)
       (pred_12 obj_15)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_24)
       (pred_12 obj_31)
       (pred_12 obj_08)
       (pred_12 obj_20)
       (pred_12 obj_19)
       (pred_12 obj_05)
       (pred_12 obj_14)
       (pred_12 obj_23)
       (pred_12 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_09)
       (pred_3 obj_21)
       (pred_5 obj_16)
       (pred_5 obj_30)
       (pred_5 obj_18)

       (pred_1 obj_12 obj_04)
       (pred_1 obj_12 obj_17)
       (pred_1 obj_17 obj_25)
       (pred_1 obj_17 obj_02)
       (pred_1 obj_17 obj_12)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_02 obj_29)
       (pred_1 obj_02 obj_17)
       (pred_1 obj_29 obj_07)
       (pred_1 obj_29 obj_22)
       (pred_1 obj_29 obj_02)
       (pred_1 obj_22 obj_28)
       (pred_1 obj_22 obj_29)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_25)
       (pred_1 obj_04 obj_12)
       (pred_1 obj_25 obj_26)
       (pred_1 obj_25 obj_11)
       (pred_1 obj_25 obj_17)
       (pred_1 obj_25 obj_04)
       (pred_1 obj_11 obj_27)
       (pred_1 obj_11 obj_07)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_25)
       (pred_1 obj_07 obj_15)
       (pred_1 obj_07 obj_28)
       (pred_1 obj_07 obj_29)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_28 obj_01)
       (pred_1 obj_28 obj_22)
       (pred_1 obj_28 obj_07)
       (pred_1 obj_06 obj_03)
       (pred_1 obj_06 obj_26)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_26 obj_24)
       (pred_1 obj_26 obj_27)
       (pred_1 obj_26 obj_25)
       (pred_1 obj_26 obj_06)
       (pred_1 obj_27 obj_31)
       (pred_1 obj_27 obj_15)
       (pred_1 obj_27 obj_11)
       (pred_1 obj_27 obj_26)
       (pred_1 obj_15 obj_08)
       (pred_1 obj_15 obj_01)
       (pred_1 obj_15 obj_07)
       (pred_1 obj_15 obj_27)
       (pred_1 obj_01 obj_20)
       (pred_1 obj_01 obj_28)
       (pred_1 obj_01 obj_15)
       (pred_1 obj_03 obj_19)
       (pred_1 obj_03 obj_24)
       (pred_1 obj_03 obj_06)
       (pred_1 obj_24 obj_05)
       (pred_1 obj_24 obj_31)
       (pred_1 obj_24 obj_26)
       (pred_1 obj_24 obj_03)
       (pred_1 obj_31 obj_14)
       (pred_1 obj_31 obj_08)
       (pred_1 obj_31 obj_27)
       (pred_1 obj_31 obj_24)
       (pred_1 obj_08 obj_23)
       (pred_1 obj_08 obj_20)
       (pred_1 obj_08 obj_15)
       (pred_1 obj_08 obj_31)
       (pred_1 obj_20 obj_10)
       (pred_1 obj_20 obj_01)
       (pred_1 obj_20 obj_08)
       (pred_1 obj_19 obj_05)
       (pred_1 obj_19 obj_03)
       (pred_1 obj_05 obj_14)
       (pred_1 obj_05 obj_24)
       (pred_1 obj_05 obj_19)
       (pred_1 obj_14 obj_23)
       (pred_1 obj_14 obj_31)
       (pred_1 obj_14 obj_05)
       (pred_1 obj_23 obj_10)
       (pred_1 obj_23 obj_08)
       (pred_1 obj_23 obj_14)
       (pred_1 obj_10 obj_20)
       (pred_1 obj_10 obj_23)
       (pred_10 obj_26)
       (pred_10 obj_17)
       (pred_10 obj_08)
       (pred_11  obj_26 obj_13)
       (pred_11  obj_17 obj_09)
       (pred_11  obj_08 obj_21)
       (pred_4 obj_12)
       (pred_4 obj_02)
       (pred_4 obj_29)
       (pred_4 obj_22)
       (pred_4 obj_04)
       (pred_4 obj_25)
       (pred_4 obj_11)
       (pred_4 obj_07)
       (pred_4 obj_28)
       (pred_4 obj_06)
       (pred_4 obj_27)
       (pred_4 obj_15)
       (pred_4 obj_01)
       (pred_4 obj_03)
       (pred_4 obj_24)
       (pred_4 obj_31)
       (pred_4 obj_20)
       (pred_4 obj_19)
       (pred_4 obj_05)
       (pred_4 obj_14)
       (pred_4 obj_23)
       (pred_4 obj_10)

       (pred_2  obj_16 obj_13)
       (pred_2  obj_30 obj_09)
       (pred_2  obj_18 obj_21)
       (pred_6 obj_16 obj_04)
       (pred_6 obj_30 obj_01)
       (pred_6 obj_18 obj_07)
       (pred_7 obj_01)
    )

    (:goal (and
       (pred_6 obj_16 obj_27)
       (pred_6 obj_30 obj_19)
    ))
(:constraints
  (always (not (pred_7 obj_03)))
)
)

; plan
1. (op_2 obj_01 obj_15)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_15)
   goals met: 0 of 2
2. (op_2 obj_15 obj_27)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_27)
   goals met: 0 of 2
3. (op_2 obj_27 obj_11)
   deleted: (pred_7 obj_27)
   added: (pred_7 obj_11)
   goals met: 0 of 2
4. (op_2 obj_11 obj_25)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_25)
   goals met: 0 of 2
5. (op_2 obj_25 obj_04)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_04)
   goals met: 0 of 2
6. (op_5 obj_04 obj_16)
   deleted: (pred_6 obj_16 obj_04) (pred_8)
   added: (pred_9 obj_16)
   goals met: 0 of 2
7. (op_2 obj_04 obj_06)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_06)
   goals met: 0 of 2
8. (op_4 obj_06 obj_26 obj_16 obj_13)
   deleted: (pred_10 obj_26)
   added: (pred_4 obj_26)
   goals met: 0 of 2
9. (op_2 obj_06 obj_26)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_26)
   goals met: 0 of 2
10. (op_2 obj_26 obj_27)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_27)
   goals met: 0 of 2
11. (op_3 obj_27 obj_16)
   deleted: (pred_9 obj_16)
   added: (pred_8) (pred_6 obj_16 obj_27)
   goals met: 1 of 2
12. (op_2 obj_27 obj_15)
   deleted: (pred_7 obj_27)
   added: (pred_7 obj_15)
   goals met: 1 of 2
13. (op_2 obj_15 obj_01)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_01)
   goals met: 1 of 2
14. (op_5 obj_01 obj_30)
   deleted: (pred_6 obj_30 obj_01) (pred_8)
   added: (pred_9 obj_30)
   goals met: 1 of 2
15. (op_2 obj_01 obj_15)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_15)
   goals met: 1 of 2
16. (op_2 obj_15 obj_27)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_27)
   goals met: 1 of 2
17. (op_2 obj_27 obj_26)
   deleted: (pred_7 obj_27)
   added: (pred_7 obj_26)
   goals met: 1 of 2
18. (op_2 obj_26 obj_24)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_24)
   goals met: 1 of 2
19. (op_2 obj_24 obj_05)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_05)
   goals met: 1 of 2
20. (op_2 obj_05 obj_19)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_19)
   goals met: 1 of 2
21. (op_3 obj_19 obj_30)
   deleted: (pred_9 obj_30)
   added: (pred_8) (pred_6 obj_30 obj_19)
   goals met: 2 of 2
